export const practiceQuesData = [

  
    {
      question: "ವಾಕ್ಯದಲ್ಲಿನ ಪದಗಳ ಸಂಖ್ಯೆಯನ್ನು ಎಣಿಸಲು ಪ್ರೋಗ್ರಾಂ ಅನ್ನು ಬರೆಯಿರಿ",
      answer: `"I am an Indian" ಅನ್ನು ಎ ನಲ್ಲಿ ಸಂಗ್ರಹಿಸಿ ಬಿ ಗೆ ಎ.ಸ್ಪ್ಲಿಟ್() ಅನ್ನು ನಿಯೋಜಿಸಿ
      ವೇರಿಯಬಲ್  ಸಿ ಗೆ ಲೆನ್(ಬಿ) ಅನ್ನು ನಿಯೋಜಿಸಿ ಸಿ ಅನ್ನು ಮುದ್ರಿಸಿ"`,
    },
    {
      question: "ಮುದ್ರಣ ಹೇಳಿಕೆಯನ್ನು ಮಾತ್ರ ಬಳಸಿಕೊಂಡು ಪ್ರತ್ಯೇಕ ಸಾಲುಗಳಲ್ಲಿ 1,2,3,4,5 ಅನ್ನು ಮುದ್ರಿಸಿ",
      answer: "1\n2\n3\n4\n5 ಮುದ್ರಿಸಿ",
    },
    {
      question: "ಪ್ರಿಂಟ್ ಸ್ಟೇಟ್‌ಮೆಂಟ್ ಅನ್ನು ಬಳಸಿಕೊಂಡು ಟ್ಯಾಬ್ ಸ್ಪೇಸ್‌ಗಳಿಂದ ಪ್ರತ್ಯೇಕಿಸಲಾದ ಅದೇ ಸಾಲುಗಳಲ್ಲಿ 1,2,3,4,5 ಅನ್ನು ಮುದ್ರಿಸಿ",
      answer: "1\t 2\t 3\t 4\t 5\t ಅನ್ನು ಮುದ್ರಿಸಿ",
    },
    {
      question: "ಲೆನ್() ಅನ್ನು ಬಳಸಿಕೊಂಡು ಸ್ಟ್ರಿಂಗ್‌ನ ಉದ್ದವನ್ನು ಮುದ್ರಿಸಲು ಪ್ರೋಗ್ರಾಂ ಅನ್ನು ಬರೆಯಿರಿ(ವೇರಿಯಬಲ್ ಎ ಬಳಸಿ )(ವೇರಿಯಬಲ್  ಬಿ ಗೆ ಲೆನ್() ಅನ್ನು ಸಂಗ್ರಹಿಸಿ)",
      answer:`ವೇರಿಯಬಲ್ ಎ ಗೆ "hello" ಅನ್ನು ನಿಯೋಜಿಸಿ
      ವೇರಿಯಬಲ್  ಬಿ ಗೆ ಲೆನ್(ಎ) ಅನ್ನು ಸಂಗ್ರಹಿಸಿ.
      ಬಿ ಅನ್ನು  ಮುದ್ರಿಸಿ `,
    }, 
    {
      question: "ಯಾವುದೇ ಇನ್‌ಪುಟ್ ತೆಗೆದುಕೊಳ್ಳಿ ಮತ್ತು ಅದರ ಡೇಟಾ ಪ್ರಕಾರವನ್ನು ಬಳಕೆದಾರರಿಗೆ ಪ್ರದರ್ಶಿಸಿ (ವೇರಿಯಬಲ್ ಎನ್ ಅನ್ನು ಬಳಸಿ)",
      answer: `ವೇರಿಯಬಲ್ ಎನ್ ಅನ್ನು ಘೋಷಿಸಿ ಮತ್ತು ಬಳಕೆದಾರರ ಆದಾನ ಸಂಖ್ಯೆಯನ್ನು ಅದರಲ್ಲಿ ಸಂಗ್ರಹಿಸಿ 
      /ವೇರಿಯಬಲ್ ಎನ್ ಅನ್ನು ಘೋಷಿಸಿ ಮತ್ತು ಬಳಕೆದಾರರ ಆದಾನ ಸ್ಟ್ರಿಂಗನ್ನು ಅದರಲ್ಲಿ ಸಂಗ್ರಹಿಸಿ  
      /ವೇರಿಯಬಲ್ ಎನ್ ಅನ್ನು ಘೋಷಿಸಿ ಮತ್ತು ಬಳಕೆದಾರರ ಆದಾನ ಫ್ಲೋಟನ್ನು ಅದರಲ್ಲಿ ಸಂಗ್ರಹಿಸಿ  
      ಎನ್ ನ ಡೇಟಾ ಪ್ರಕಾರವನ್ನು ಮುದ್ರಿಸಿ`,
    },
];