export const practiceQuesData = [
    {
        question: "10,12 ಮತ್ತು 14 ರ ನಡುವೆ ದೊಡ್ಡ ಸಂಖ್ಯೆಯನ್ನು ಮುದ್ರಿಸಲು ಪ್ರೋಗ್ರಾಂ ಅನ್ನು ಬರೆಯಿರಿ",
        answer: `ವೇರಿಯಬಲ್ ಎ ಗೆ ಸಂಖ್ಯೆ ಹತ್ತನ್ನು ನಿಯೋಜಿಸಿ
        ವೇರಿಯಬಲ್ ಬಿ ಗೆ ಸಂಖ್ಯೆ ಹನ್ನೆರಡನ್ನು ನಿಯೋಜಿ
        ವೇರಿಯಬಲ್ ಸಿ ಗೆ ಸಂಖ್ಯೆ 14 ಅನ್ನು ನಿಯೋಜಿಸಿ
        ಒಂದು ವೇಳೆ ವೇರಿಯಬಲ್ ಎ ವೇರಿಯಬಲ್ ಬಿಗೆ ಸಮಾನವಿದ್ದು ಅಥವಾ ಬಿ ಗಿಂತ ದೊಡ್ಡದಿದ್ದು ಹಾಗೂ ವೇರಿಯಬಲ್ ಎ ವೇರಿಯಬಲ್ ಸಿ ಗೆ ಸಮಾನವಿದ್ದು ಅಥವಾ ಸಿ ಗಿಂತ ದೊಡ್ಡದಿದ್ದರೆ ವೇರಿಯಬಲ್ ಎ ಎಲ್ಲದಕ್ಕಿಂತ ದೊಡ್ಡದು. ಅತ್ಯಂತ ದೊಡ್ಡದು  ಎನ್ನುವ ವೇರಿಯಬಲ್ ಗೆ ಎ ವೇರಿಯಬಲ್ ಅನ್ನು ನಿಯೋಜಿಸಿ
        ಇಲ್ಲದಿದ್ದರೆ ಒಂದು ವೇಳೆ ವೇರಿಯಬಲ್ ಬಿ ವೇರಿಯಬಲ್ ಎ ಗೆ ಸಮಾನವಿದ್ದು ಅಥವಾ ಎ ಗಿಂತ ದೊಡ್ಡದಿದ್ದು ಹಾಗೂ ವೇರಿಯಬಲ್ ಬಿ ವೇರಿಯಬಲ್ ಸಿ ಗೆ ಸಮಾನವಿದ್ದು ಅಥವಾ ಸಿ ಗಿಂತ ದೊಡ್ಡದಿದ್ದರೆ ವೇರಿಯಬಲ್ ಬಿ ಎಲ್ಲದಕ್ಕಿಂತ ದೊಡ್ಡದು. ಬಿ ವೇರಿಯಬಲ್ ಅನ್ನು ಅತ್ಯಂತ ದೊಡ್ಡದು ಎನ್ನುವ ವೇರಿಯಬಲ್ ಗೆ ನಿಯೋಜಿಸಿ
        ಇಲ್ಲದಿದ್ದಲ್ಲಿ ವೇರಿಯಬಲ್ ಸಿ ಎಲ್ಲದಕ್ಕಿಂತ ದೊಡ್ಡದು.ಅತ್ಯಂತ ದೊಡ್ಡದು ಎನ್ನುವ ವೇರಿಯಬಲ್ ಗೆ ಸಿ ವೇರಿಯಬಲ್ ಅನ್ನು ನಿಯೋಜಿಸಿ
        ಈಗ ವೇರಿಯಬಲ್ ಅತ್ಯಂತ ದೊಡ್ಡದು ಅನ್ನು ಮುದ್ರಿಸಿ
        ನೀವು ಅಲ್ಗಾರಿದಮ್ನ ಕ್ರಮವನ್ನು ಬದಲಾಯಿಸಬಹುದು ಮತ್ತು ಪ್ರಯತ್ನಿಸಬಹುದು`,
    },
    {
        question: "ವೇರಿಯಬಲ್ ವಯಸ್ಸಿನಲ್ಲಿ ವಯಸ್ಸನ್ನು ಇನ್‌ಪುಟ್ ಆಗಿ ತೆಗೆದುಕೊಳ್ಳಿ ಮತ್ತು ವ್ಯಕ್ತಿಯು ಮತ ಚಲಾಯಿಸಲು ಅರ್ಹರಾಗಿದ್ದಾರೆಯೇ ಎಂದು ಪರಿಶೀಲಿಸಿ",
        answer: `ವೇರಿಯೇಬಲ್ ವಯಸ್ಸನ್ನು ಘೋಷಿಸಿ ಮತ್ತು ಬಳಕೆದಾರರ ಆದಾನ ಸಂಖ್ಯಾ ಮೌಲ್ಯವನ್ನು ನಿಯೋಜಿಸಿ
        ಒಂದೂವೇಳೆ ವಯಸ್ಸು 18 ಗಿಂತ್ ಹೆಚ್ಚು ಅಥವ ಸಮ ಇದ್ದ್ರೆ ನೀವು ಮತ ​​ಹಾಕಬಹುದು ಎಂದು ಮುದ್ರಿಸಿ
        ಇಲ್ಲದಿದ್ದರೆ ನೀವು ಮತ ​​ಚಲಾಯಿಸಲು ಅರ್ಹರಲ್ಲ ಎಂದು ಮುದ್ರಿಸಿ
        `,
    },
    {
        question: "ವೇರಿಯಬಲ್ ವರ್ಷದಲ್ಲಿ ಒಂದು ವರ್ಷವನ್ನು ಇನ್‌ಪುಟ್ ಆಗಿ ತೆಗೆದುಕೊಳ್ಳಿ ಮತ್ತು ಅದು ಅಧಿಕ ವರ್ಷ ಅಥವಾ ಅಲ್ಲ ಎಂದು ಮುದ್ರಿಸಿ (ಚಿಹ್ನೆಗಳ ಇನ್ಪುಟ್ ಳಸಿ)",
        answer: `ವೇರಿಯಬಲ್ ವರ್ಷ ಅನ್ನು ಘೋಷಿಸಿ ಮತ್ತು ಬಳಕೆದಾರರ ಆದಾನ ಅದರಲ್ಲಿ ಸಂಗ್ರಹಿಸಿ
        ಒಂದೂವೇಳೆ ವರ್ಷ%4==0 ಮತ್ತು ವರ್ಷ%100!=0 ಅಥವಾ ವರ್ಷ%400==0 ಇದ್ದರೇ ಇದು ಅಧಿಕ ವರ್ಷ ಎಂದು ಮುದ್ರಿಸಿ
        ಇಲ್ಲದ್ದಿದ್ದರೆ ಇದು ಅಧಿಕ ವರ್ಷವಲ್ಲ ಎಂದು ಮುದ್ರಿಸಿ`,
    },
    {
        question: "ಒಂದು ಸಂಖ್ಯೆಯನ್ನು ಇನ್‌ಪುಟ್ ಆಗಿ ತೆಗೆದುಕೊಂಡು ಅದನ್ನು 13 ರಿಂದ ಭಾಗಿಸಬಹುದೇ ಅಥವಾ ಇಲ್ಲವೇ ಎಂಬುದನ್ನು ಪರಿಶೀಲಿಸಿ",
        answer: `ವೇರಿಯಬಲ್ ಎಕ್ಸ್ ಅನ್ನು ಘೋಷಿಸಿ ಮತ್ತು ಬಳಕೆದಾರರ ಆದಾನ ಸಂಖ್ಯೆಯನ್ನು ಅದರಲ್ಲಿ ಸಂಗ್ರಹಿಸಿ
        ಒಂದು ವೇಳೆ X % 13 ಸೊನ್ನೆ ಆಗಿದ್ದರೆ ಎಕ್ಸ್ ಅನ್ನು 13 ರಿಂದ ಭಾಗಿಸಬಹುದು ಎಂದು ಮುದ್ರಿಸಿ
        ಇಲ್ಲದಿದ್ದರೆ ಎಕ್ಸ್ ಅನ್ನು 13 ರಿಂದ ಭಾಗಿಸಲು ಸಾಧ್ಯವಿಲ್ಲ ಎಂದು ಮುದ್ರಿಸ`,
    },
    {
        question: "ವಿದ್ಯಾರ್ಥಿಯ ಅಂಕಗಳನ್ನು ಇನ್‌ಪುಟ್ ಆಗಿ ತೆಗೆದುಕೊಳ್ಳಿ ಮತ್ತು ಅಂಕಗಳು 90 ಕ್ಕಿಂತ ಹೆಚ್ಚಿದ್ದರೆ A, ಅಂಕಗಳು 70-90 ವ್ಯಾಪ್ತಿಯಲ್ಲಿದ್ದರೆ B, ಅಂಕಗಳು 50-70 ವ್ಯಾಪ್ತಿಯಲ್ಲಿದ್ದರೆ C, ಅಂಕಗಳು 30-50 ರ ವ್ಯಾಪ್ತಿಯಲ್ಲಿದ್ದರೆ D, ಮತ್ತು ಅಂಕಗಳು 30 ಕ್ಕಿಂತ ಕಡಿಮೆ ಇದ್ದರೆ ಎಫ್ ಗ್ರೇಡ್ ಅನ್ನು ಪ್ರದರ್ಶಿಸಿ (ವೇರಿಯಬಲ್ ಎನ್ ಅನ್ನು ಬಳಸಿ).",
        answer: `ವೇರಿಯಬಲ್ ಎನ್ ಗೆ ಇಂಟೀಜರ್ ಇನ್ಪುಟ್ ಸಂಖ್ಯೆಯನ್ನು ನಿಯೋಜಿಸಿ
        ಒಂದು ವೇಳೆ ಎನ್ ತೊಂಬತ್ತು ಅಥವಾ ತೊಂಬತ್ತಿಕ್ಕಿಂತ ಹೆಚ್ಚಿದಲ್ಲಿ "ನೀವು ಎ ಗ್ರೇಡ್ ಪಡೆದಿದ್ದೀರಿ" ಎಂದು ಮುದ್ರಿಸಿ
        ಇಲ್ಲದಿದ್ದರೆ ಒಂದು ವೇಳೆ ಎನ್ ಎಪ್ಪತ್ತು ಅಥವಾ ಎಪ್ಪತ್ತಕ್ಕಿಂತ ಹೆಚ್ಚಿದಲ್ಲಿ "ನೀವು ಬಿ ಗ್ರೇಡ್ ಪಡೆದಿದ್ದೀರಿ" ಎಂದು ಮುದ್ರಿಸಿ
        ಇಲ್ಲದಿದ್ದರೆ ಒಂದು ವೇಳೆ ಎನ್ ಐವತ್ತು ಅಥವಾ ಐವತ್ತಕಿಂತ ಹೆಚ್ಚಿದಲ್ಲಿ "ನೀವು ಸಿ ಗ್ರೇಡ್ ಪಡೆದಿದ್ದೀರಿ" ಎಂದು ಮುದ್ರಿಸಿ
        ಇಲ್ಲದಿದ್ದರೆ ಒಂದು ವೇಳೆ ಎನ್ ಮೂವತ್ತು ಅಥವಾ ಮೂವತ್ತಕ್ಕಿಂತ ಹೆಚ್ಚಿದಲ್ಲಿ "ನೀವು ಡಿ ಗ್ರೇಡ್ ಪಡೆದಿದ್ದೀರಿ" ಎಂದು ಮುದ್ರಿಸಿ
        ಇಲ್ಲದಿದ್ದರೆ ಒಂದು ವೇಳೆ ಎನ್ ಐವತ್ತಕಿಂತ ಕಡಿಮೆ ಇದ್ದರೆ "ನೀವು ಎಫ್ ಗ್ರೇಡ್ ಪಡೆದಿದ್ದೀರಿ" ಎಂದು ಮುದ್ರಿಸಿ
        ಇಲ್ಲದಿದ್ದರೆ "ಅಮಾನ್ಯ ಇನ್ಪುಟ್" ಎಂದು ಮುದ್ರಿಸಿ`,
    },
    {
        question: "1-7 ರಿಂದ ಸಂಖ್ಯೆಯನ್ನು ತೆಗೆದುಕೊಳ್ಳಿ ಮತ್ತು ವಾರದ ಅನುಗುಣವಾದ ದಿನವನ್ನು  ಮುದ್ರಿಸಿ",
        answer: `ಎನ್ ಎನ್ನುವ ವೇರಿಯಬಲ್ಗೆ ಒಂದರಿಂದ ಏಳರವರೆಗೆ ಬಳಕೆದಾರರು ನೀಡುವ ಸಂಖ್ಯೆಯನ್ನು ನಿಯೋಜಿಸಿ
        ಒಂದು ವೇಳೆ ಎನ್ ಒಂದಾಗಿದ್ದರೆ ರವಿವಾರ ಎಂದು ಮುದ್ರಿಸಿ
        ಇಲ್ಲದಿದ್ದರೆ ಒಂದು ವೇಳೆ ಎನ್ ಎರಡಾಗಿದ್ದರೆ ಸೋಮವಾರ ಎಂದು ಮುದ್ರಿಸಿ
        ಇಲ್ಲದಿದ್ದರೆ ಒಂದು ವೇಳೆ ಎನ್ ಮೂರಾಗಿದ್ದರೆ ಮಂಗಳವಾರ ಎಂದು ಮುದ್ರಿಸಿ
        ಇಲ್ಲದಿದ್ದರೆ ಒಂದು ವೇಳೆ ಎನ್ ನಾಲ್ಕು ಆಗಿದ್ದರೆ ಬುಧವಾರ ಎಂದು ಮುದ್ರಿಸಿ
        ಇಲ್ಲದಿದ್ದರೆ ಒಂದು ವೇಳೆ ಎನ್ ಐದು ಗಿದ್ದರೆ ಗುರುವಾರ ಎಂದು ಮುದ್ರಿಸಿ
        ಇಲ್ಲದಿದ್ದರೆ ಒಂದು ವೇಳೆ ಎನ್ ಆರು ಆಗಿದ್ದರೆ ಶುಕ್ರವಾರ ಎಂದು ಮುದ್ರಿಸಿ
        ಇಲ್ಲದಿದ್ದರೆ ಶನಿವಾರ ಎಂದು ಮುದ್ರಿಸಿ`,
    },
    {
        question: "ಒಂದು ಸಂಖ್ಯೆಯನ್ನು ಇನ್ಪುಟ್ (ವೇರಿಯಬಲ್ ಎನ್ ) ಆಗಿ ತೆಗೆದುಕೊಳ್ಳಿ ಮತ್ತು ಅದು ಬೆಸ ಅಥವಾ ಸಮವಾಗಿದೆಯೇ ಎಂದು ಪರಿಶೀಲಿಸಿ",
        answer: `ವೇರಿಯೇಬಲ್ ಎನ್  ಅನ್ನು ಘೋಷಿಸಿ ಮತ್ತು ಬಳಕೆದಾರರ ಇನ್‌ಪುಟ್ ಸಂಖ್ಯಾ ಮೌಲ್ಯವನ್ನು ನಿಯೋಜಿಸಿ
        ಒಂದು ವೇಳೆ ಎನ್ ಅನ್ನು 2 ರಿಂದ ಭಾಗಿಸಿದರೆ ಶೂನ್ಯ ರೀಮಿಯಾಂಡರ್ ಅನ್ನು ನೀಡಿದರೆ "ಎನ್ ಒಂದು ಸಮ ಸಂಖ್ಯೆ" ಎಂದು ಮುದ್ರಿಸಿ
        ಇಲ್ಲದಿದ್ದರೆ "ಎನ್ ಒಂದು ಬೆಸ ಸಂಖ್ಯೆ" ಎಂದು ಮುದ್ರಿಸಿ`,
    },
    {
        question: "3 ಸಂಖ್ಯೆಗಳಲ್ಲಿ ಚಿಕ್ಕ ಸಂಖ್ಯೆಯನ್ನು ಕಂಡುಹಿಡಿಯಲು ಪ್ರೋಗ್ರಾಂ ಅನ್ನು ಬರೆಯಿರಿ",
        answer: `ವೇರಿಯೇಬಲ್ ಎ  ಅನ್ನು ಘೋಷಿಸಿ ಮತ್ತು ಬಳಕೆದಾರರ ಇನ್‌ಪುಟ್ ಸಂಖ್ಯಾ ಮೌಲ್ಯವನ್ನು ನಿಯೋಜಿಸಿ
        ವೇರಿಯೇಬಲ್ ಬಿ  ಅನ್ನು ಘೋಷಿಸಿ ಮತ್ತು ಬಳಕೆದಾರರ ಇನ್‌ಪುಟ್ ಸಂಖ್ಯಾ ಮೌಲ್ಯವನ್ನು ನಿಯೋಜಿಸಿ
        ವೇರಿಯೇಬಲ್ ಸಿ  ಅನ್ನು ಘೋಷಿಸಿ ಮತ್ತು ಬಳಕೆದಾರರ ಇನ್‌ಪುಟ್ ಸಂಖ್ಯಾ ಮೌಲ್ಯವನ್ನು ನಿಯೋಜಿಸಿ
        ಒಂದು ವೇಳೆ ವೇರಿಯಬಲ್ ಎ ವೇರಿಯಬಲ್ ಬಿಗೆ ಸಮಾನವಿದ್ದು ಅಥವಾ ಬಿ ಗಿಂತ ಚಿಕ್ಕದಾಗಿದ್ದರೆ ಹಾಗೂ ವೇರಿಯಬಲ್ ಎ ವೇರಿಯಬಲ್ ಸಿ ಗೆ ಸಮಾನವಿದ್ದು ಅಥವಾ ಸಿ ಗಿಂತ ಚಿಕ್ಕದಾಗಿದ್ದರೆ ವೇರಿಯಬಲ್ ಎ ಎಲ್ಲದಕ್ಕಿಂತ ಚಿಕ್ಕದು. ಅತ್ಯಂತ ಚಿಕ್ಕದು ಎನ್ನುವ ವೇರಿಯಬಲ್ ಗೆ ಎ ವೇರಿಯಬಲ್ ಅನ್ನು ನಿಯೋಜಿಸಿ
        ಇಲ್ಲದಿದ್ದರೆ ಒಂದು ವೇಳೆ ವೇರಿಯಬಲ್ ಬಿ ವೇರಿಯಬಲ್ ಎ ಗೆ ಸಮಾನವಿದ್ದು ಅಥವಾ ಎ ಗಿಂತ ಚಿಕ್ಕದಾಗಿದ್ದರೆ ಹಾಗೂ ವೇರಿಯಬಲ್ ಬಿ ವೇರಿಯಬಲ್ ಸಿ ಗೆ ಸಮಾನವಿದ್ದು ಅಥವಾ ಸಿ ಗಿಂತ ಚಿಕ್ಕದಾಗಿದ್ದರೆ ವೇರಿಯಬಲ್ ಬಿ ಎಲ್ಲದಕ್ಕಿಂತ ಚಿಕ್ಕದು. ಬಿ ವೇರಿಯಬಲ್ ಅನ್ನು ಅತ್ಯಂತ ಚಿಕ್ಕದು ಎನ್ನುವ ವೇರಿಯಬಲ್ ಗೆ ನಿಯೋಜಿಸಿ
        ಇಲ್ಲದಿದ್ದಲ್ಲಿ ವೇರಿಯಬಲ್ ಸಿ ಎಲ್ಲದಕ್ಕಿಂತ ಚಿಕ್ಕದು.ಅತ್ಯಂತ ಚಿಕ್ಕದು ಎನ್ನುವ ವೇರಿಯಬಲ್ ಗೆ ಸಿ ವೇರಿಯಬಲ್ ಅನ್ನು ನಿಯೋಜಿಸಿ
        ಅತ್ಯಂತ ಚಿಕ್ಕದು ಮುದ್ರಿಸಿ`,
    },
];